benchmark/rhoPorousSimpleFoam/cells_1960013/0/U
// ************************************************************************* //

FoamFile
{
    object               U;
    format               ascii;
    location             0;
    version              2.0;
    class                volVectorField;
}

// ************************************************************************* //

internalField        uniform ( 0 0 0 );

dimensions           [0 1 -1 0 0 0 0];

// ************************************************************************* //
boundaryField
{
    ".*"
    {
        type                 fixedValue;
        value                uniform ( 0 0 0 );
    }
    stl_walls
    {
        type                 fixedValue;
        value                uniform ( 0 0 0 );
    }
    stl_inlet
    {
        massFlowRate         0.3333;
        type                 flowRateInletVelocity;
        value                uniform ( 0 0 0 );
    }
    defaultFaces
    {
        type                 empty;
    }
    stl_fine
    {
        type                 fixedValue;
        value                uniform ( 0 0 0 );
    }
    stl_outlet
    {
        inletValue           uniform ( 0 0 0 );
        type                 inletOutlet;
        value                uniform ( 0 0 0 );
    }
    stl_coarse
    {
        type                 fixedValue;
        value                uniform ( 0 0 0 );
    }
}

// ************************************************************************* //
