benchmark/rhoPorousSimpleFoam/cells_1960013/constant/RASProperties
// ************************************************************************* //

FoamFile
{
    object               RASProperties;
    format               ascii;
    location             "constant";
    version              2.0;
    class                dictionary;
}

// ************************************************************************* //

printCoeffs          on;

turbulence           on;

RASModel             kEpsilon;

